#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
null_resource.always_run: Refreshing state... [id=6749796028778753556]
local_file.k3s_ansible_host_cloud_config: Refreshing state... [id=726099b53168c8bf93aab0585c5f2776c3fd34f2]
null_resource.k3s_ansible_host_cloud_config_ssh_file_provisioner: Refreshing state... [id=3029143117828189594]
proxmox_vm_qemu.k3s-manager-worker-3: Refreshing state... [id=milky-carina/qemu/11002]
proxmox_lxc.cloudflare-tunnel-solufit-1: Refreshing state... [id=milky-capella/lxc/2003]
proxmox_vm_qemu.k3s-manager-controller-1: Refreshing state... [id=milky-capella/qemu/10000]
proxmox_vm_qemu.k3s-manager-worker-2: Refreshing state... [id=milky-polaris/qemu/11001]
proxmox_vm_qemu.k3s-manager-ansible-host: Refreshing state... [id=milky-capella/qemu/1000]
proxmox_vm_qemu.cloudflare-tunnel-solufit-2: Refreshing state... [id=milky-polaris/qemu/2004]
proxmox_vm_qemu.k3s-manager-worker-1: Refreshing state... [id=milky-capella/qemu/11000]
proxmox_vm_qemu.cloudflare-tunnel-solufit-4: Refreshing state... [id=milky-carina/qemu/2006]
proxmox_vm_qemu.k3s-manager-controller-2: Refreshing state... [id=milky-carina/qemu/10001]
proxmox_vm_qemu.k3s-manager-controller-3: Refreshing state... [id=milky-polaris/qemu/10002]
proxmox_vm_qemu.cloudflare-tunnel-solufit-3: Refreshing state... [id=milky-carina/qemu/2005]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # local_file.k3s_ansible_host_cloud_config will be created
  + resource "local_file" "k3s_ansible_host_cloud_config" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./files/ansible-host-cloud-config.yaml"
      + id                   = (known after apply)
    }

  # null_resource.always_run must be replaced
+/- resource "null_resource" "always_run" {
      ~ id       = "6749796028778753556" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2025-01-05T13:33:05Z" -> (known after apply)
        }
    }

  # null_resource.k3s_ansible_host_cloud_config_ssh_file_provisioner will be replaced due to changes in replace_triggered_by
+/- resource "null_resource" "k3s_ansible_host_cloud_config_ssh_file_provisioner" {
      ~ id = "3029143117828189594" -> (known after apply)
    }

  # proxmox_lxc.cloudflare-tunnel-solufit-1 is tainted, so must be replaced
-/+ resource "proxmox_lxc" "cloudflare-tunnel-solufit-1" {
      - bwlimit              = 0 -> null
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
      - force                = false -> null
      ~ id                   = "milky-capella/lxc/2003" -> (known after apply)
      - ignore_unpack_errors = false -> null
      ~ ostype               = "ubuntu" -> (known after apply)
      - restore              = false -> null
      + tags                 = (known after apply)
      - template             = false -> null
      - unique               = false -> null
      ~ unprivileged         = true -> false
      ~ unused               = [] -> (known after apply)
        # (24 unchanged attributes hidden)

      ~ network {
          ~ hwaddr   = "BC:24:11:1B:67:90" -> (known after apply)
          ~ id       = 0 -> (known after apply)
          - mtu      = 0 -> null
            name     = "eth0"
          - rate     = 0 -> null
          ~ tag      = 0 -> (known after apply)
          + trunks   = (known after apply)
          ~ type     = "veth" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ network {
          ~ hwaddr   = "BC:24:11:67:DE:A7" -> (known after apply)
          ~ id       = 1 -> (known after apply)
            name     = "eth1"
          - rate     = 0 -> null
          ~ tag      = 0 -> (known after apply)
          + trunks   = (known after apply)
          ~ type     = "veth" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ rootfs {
          - acl       = false -> null
          - quota     = false -> null
          - replicate = false -> null
          - ro        = false -> null
          - shared    = false -> null
          ~ volume    = "local-lvm:vm-2003-disk-0" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-2 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-2" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-polaris/qemu/2004"
        name                   = "solufit-cloudflare-tunnel-2"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-3 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-3" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-carina/qemu/2005"
        name                   = "solufit-cloudflare-tunnel-3"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-4 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-4" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-carina/qemu/2006"
        name                   = "solufit-cloudflare-tunnel-4"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-ansible-host will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-ansible-host" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/1000"
        name                   = "k3s-ansible-host"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-1" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/10000"
        name                   = "solufit-k3s-controller-1"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-2 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-2" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-carina/qemu/10001"
        name                   = "solufit-k3s-controller-2"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-3 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-3" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-polaris/qemu/10002"
        name                   = "solufit-k3s-controller-3"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-1" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/11000"
        name                   = "solufit-k3s-worker-1"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-2 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-2" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-polaris/qemu/11001"
        name                   = "solufit-k3s-worker-2"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-3 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-3" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-carina/qemu/11002"
        name                   = "solufit-k3s-worker-3"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 4 to add, 10 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>


*Pushed by: @Walkmana-25, Action: `pull_request`*